Repository: nuvtools/nuvtools-resources
Catalog: src/NuvTools.Resources/Messages.*.resx
Languages: pt_br

source: Access denied.
pt_br: Acesso negado.

# AddXClickingY
source: Add new {0} by clicking {1}.
pt_br: Inclua novos(as) {0} clicando em {1}.

# AtLeastOneTheseParametersShoudBeFilledX
source: At least one of these parameters should be filled: {0}.
pt_br: Pelo menos um desses parâmetros deve ser informado: {0}.

source: Cancel deletion
pt_br: Cancelar Exclusão

source: Code expired.
pt_br: Código expirado.

# CouldNotDeleteXExistYAssociated
source: Could not delete {0}. There are {1} associated.
pt_br: Não foi possível excluir {0}. Existem {1} associados(as).

# CouldNotDeleteXVerifyAssociatedData
source: Could not delete {0}. Verify if there is associated data.
pt_br: Não foi possível excluir {0}. Verifique se existem dados associados.

# DateXMustBeAfterDateY
source: Date {0} must be after date {1}.
pt_br: A data {0} deve ser posterior à data {1}.

source: Do you really logout?
pt_br: Deseja realmente sair?

# EmailConfirmationContentWithLinkX
source: Please confirm your account by <a href='{0}'>clicking here</a>.
pt_br: Confirme sua conta <a href='{0}'>clicando aqui</a>.

source: E-mail confirmed.
pt_br: E-mail confirmado.

source: E-mail must be confirmed.
pt_br: E-mail precisa estar confirmado.

# EmailXAlreadyTaken
source: E-mail {0} is already taken.
pt_br: E-mail {0} já em uso.

source: End date must be greater than start date.
pt_br: A data de término deve ser maior que a data de início.

source: Error in provided parameters.
pt_br: Erro nos parâmetros informados.

# FailedToCreateX
source: Failed to create {0}.
pt_br: Falha ao cadastrar {0}.

# FailedToDeleteX
source: Failed to delete {0}.
pt_br: Falha ao excluir {0}.

# FailedToGenerateX
source: Failed to generate {0}.
pt_br: Falha ao gerar {0}.

# FailedToUpdateX
source: Failed to update {0}.
pt_br: Falha ao atualizar {0}.

# IdObjectNotMatchUrl
source: The ID in the object does not match the ID in the URL.
pt_br: O ID no objeto não corresponde ao ID no URL.

source: Inactive user.
pt_br: Usuário inativo.

# InvalidExpiredToken
source: Invalid or expired token.
pt_br: Token inválido ou expirado.

# InvalidFileTypeAcceptedFormatX
source: Invalid file type. Accepted format: {0}.
pt_br: Tipo de arquivo inválido. Formato aceito: {0}.

source: Login successful.
pt_br: Login bem sucedido.

source: Logout Confirmation
pt_br: Confirmação de Saída

source: None parameter informed.
pt_br: Nenhum parâmetro informado.

# NoPermissionToDeleteX
source: No permission to delete {0}.
pt_br: Sem permissão para excluir {0}.

source: Not Allowed.
pt_br: Não permitido.

source: Operation performed successfully.
pt_br: Operação realizada com sucesso.

# PasswordResetEmailContentWithLinkX
source: Please reset your password by <a href='{0}'>clicking here</a>.
pt_br: Por favor, redefina sua senha <a href='{0}'>clicando aqui</a>.

source: Password reset failed.
pt_br: Falha ao redefinir senha.

source: Password Reset Mail was sent.
pt_br: E-mail para redefinição de senha enviado.

source: Password Reset Successful!
pt_br: Senha redefinida com sucesso!

source: Processing completed.
pt_br: Processamento concluído.

source: Provide at least one parameter.
pt_br: Informe pelo menos um parâmetro.

# ProvideAtLeastOneX
source: Provide at least one {0}.
pt_br: Informe pelo menos um(a) {0}.

source: Text copied.
pt_br: Texto copiado.

source: The operation could not be performed.
pt_br: Não foi possível realizar a operação.

# ThereIsNoXRegisteredSoFar
source: There is no {0} registered so far.
pt_br: Nenhum(a) {0} cadastrado(a) até o momento.

# ToConfirmDeletion
source: Confirm deletion
pt_br: Para confirmar a exclusão

# UploadedFileIsEmpty
source: The uploaded file is empty.
pt_br: O arquivo enviado está vazio.

# ValidationProblemsFound
source: Validation problems were found.
pt_br: Problemas de validação encontrados.

source: Valid verification code.
pt_br: Código de verificação válido.

source: Value outside range
pt_br: Valor fora da faixa

# ViewX
source: View {0}
pt_br: Ver {0}

# WelcomeX
source: Welcome {0}.
pt_br: Seja bem-vindo(a) {0}.

# XAlreadyExists
source: {0} already exists.
pt_br: {0} já existe.

# XDeletedSuccessfully
source: {0} deleted successfully.
pt_br: {0} excluído(a) com sucesso.

# XIncomplete
source: {0} incomplete.
pt_br: {0} incompleto(a).

# XInvalid
source: {0} is invalid.
pt_br: {0} inválido(a).

# XMustBeEqualY
source: The {0} must be equal {1}.
pt_br: O(A) {0} deve ser igual ao(à) {1}.

# XMustBeGreaterThanY
source: {0} must be greater than {1}.
pt_br: {0} deve ser maior do que {1}.

# XMustBeLessThanY
source: {0} must be less than {1}.
pt_br: {0} deve ser menor do que {1}.

# XMustContainAtLeastYCapitalLetters
source: The {0} must contain at least {1} capital letter(s).
pt_br: O(A) {0} deve conter pelo menos {1} letra(s) maiúscula(s).

# XMustContainAtLeastYDigits
source: The {0} must contain at least {1} digit(s).
pt_br: O(A) {0} deve conter pelo menos {1} dígito(s).

# XMustContainAtLeastYLowerCaseLetters
source: The {0} must contain at least {1} lower case letter(s).
pt_br: O(A) {0} deve conter pelo menos {1} letra(s) minúscula(s).

# XMustContainBetweenYandZCharacters
source: The {0} must contain between {1} and {2} character(s).
pt_br: O(A) {0} deve conter entre {1} e {2} caracteres.

# XMustHaveAtLeastYCharacters
source: The {0} must have at least {1} character(s).
pt_br: O(A) {0} deve ter pelo menos {1} caracter(s).

# XMustHaveUpToYCharacters
source: The {0} must have up to {1} character(s).
pt_br: O(A) {0} deve ter até {1} caractere(s).

# XNotFound
source: {0} not found.
pt_br: {0} não encontrado(a).

# XNotProvided
source: {0} not provided.
pt_br: {0} não informado(a).

# XRegisteredSuccessfully
source: {0} registered successfully.
pt_br: {0} cadastrado(a) com sucesso.

# XRequired
source: {0} is required.
pt_br: {0} é obrigatório(a).

# XUpdatedSuccessfully
source: {0} updated successfully.
pt_br: {0} atualizado(a) com sucesso.

# XYSuccess
source: {0} {1} successfully.
pt_br: {0} {1} com sucesso.
